In [5]:
import json
import pandas as pd

In [6]:
with open('raw_results.json') as f:
  data = json.load(f)

In [7]:
df = pd.DataFrame(data)

In [8]:
df.head()

,id,game_date,game_season,team_id,opponent_id,team_points,opponent_points,is_team_home,is_overtime
0,1,2009-10-30,2010,1,6,86,99,False,False
1,2,2009-10-31,2010,1,13,96,85,True,False
2,3,2009-11-03,2010,1,11,81,83,False,False
3,4,2009-11-06,2010,1,29,87,72,False,False
4,5,2009-11-07,2010,1,12,102,87,True,False

In [20]:
# 33

df['league_id'] = df['team_id'].apply(lambda i: 1 if int(i) < 34 else 2)

In [14]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 47864 entries, 0 to 47863
Data columns (total 9 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   id               47864 non-null  object
 1   game_date        47864 non-null  object
 2   game_season      47864 non-null  object
 3   team_id          47864 non-null  object
 4   opponent_id      47864 non-null  object
 5   team_points      47864 non-null  object
 6   opponent_points  47864 non-null  object
 7   is_team_home     47864 non-null  object
 8   is_overtime      47864 non-null  object
dtypes: object(9)
memory usage: 3.3+ MB

In [23]:
df.head()

,id,game_date,game_season,team_id,opponent_id,team_points,opponent_points,is_team_home,is_overtime,league_id
0,1,2009-10-30,2010,1,6,86,99,False,False,1
1,2,2009-10-31,2010,1,13,96,85,True,False,1
2,3,2009-11-03,2010,1,11,81,83,False,False,1
3,4,2009-11-06,2010,1,29,87,72,False,False,1
4,5,2009-11-07,2010,1,12,102,87,True,False,1

In [24]:
numeric_cols = ['id','game_season', 'team_id', 'opponent_id', 'team_points', 'opponent_points']
df[numeric_cols] = df[numeric_cols].apply(pd.to_numeric, downcast='integer', axis=1)

In [25]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 47864 entries, 0 to 47863
Data columns (total 10 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   id               47864 non-null  int32
 1   game_date        47864 non-null  object
 2   game_season      47864 non-null  int32
 3   team_id          47864 non-null  int32
 4   opponent_id      47864 non-null  int32
 5   team_points      47864 non-null  int32
 6   opponent_points  47864 non-null  int32
 7   is_team_home     47864 non-null  object
 8   is_overtime      47864 non-null  object
 9   league_id        47864 non-null  int64
dtypes: int32(6), int64(1), object(3)
memory usage: 2.6+ MB

In [26]:
df['game_date'] = pd.to_datetime(df['game_date'])

In [27]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 47864 entries, 0 to 47863
Data columns (total 10 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   id               47864 non-null  int32
 1   game_date        47864 non-null  datetime64[ns]
 2   game_season      47864 non-null  int32
 3   team_id          47864 non-null  int32
 4   opponent_id      47864 non-null  int32
 5   team_points      47864 non-null  int32
 6   opponent_points  47864 non-null  int32
 7   is_team_home     47864 non-null  object
 8   is_overtime      47864 non-null  object
 9   league_id        47864 non-null  int64
dtypes: datetime64[ns](1), int32(6), int64(1), object(2)
memory usage: 2.6+ MB

In [28]:
bool_dict = {'True': 1, 'False': 0}

df['is_team_home'].replace(bool_dict, inplace=True)
df['is_overtime'].replace(bool_dict, inplace=True)

df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 47864 entries, 0 to 47863
Data columns (total 10 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   id               47864 non-null  int32
 1   game_date        47864 non-null  datetime64[ns]
 2   game_season      47864 non-null  int32
 3   team_id          47864 non-null  int32
 4   opponent_id      47864 non-null  int32
 5   team_points      47864 non-null  int32
 6   opponent_points  47864 non-null  int32
 7   is_team_home     47864 non-null  int64
 8   is_overtime      47864 non-null  int64
 9   league_id        47864 non-null  int64
dtypes: datetime64[ns](1), int32(6), int64(3)
memory usage: 2.6 MB

In [29]:
df.head()

,id,game_date,game_season,team_id,opponent_id,team_points,opponent_points,is_team_home,is_overtime,league_id
0,1,2009-10-30,2010,1,6,86,99,0,0,1
1,2,2009-10-31,2010,1,13,96,85,1,0,1
2,3,2009-11-03,2010,1,11,81,83,0,0,1
3,4,2009-11-06,2010,1,29,87,72,0,0,1
4,5,2009-11-07,2010,1,12,102,87,1,0,1

In [30]:
df[df['league_id'] == 2]

,id,game_date,game_season,team_id,opponent_id,team_points,opponent_points,is_team_home,is_overtime,league_id
24118,24119,2009-10-01,2010,34,42,1,4,1,0,2
24119,24120,2009-10-03,2010,34,45,7,2,1,0,2
24120,24121,2009-10-08,2010,34,62,1,6,1,0,2
24121,24122,2009-10-10,2010,34,47,4,3,1,1,2
24122,24123,2009-10-12,2010,34,51,3,4,1,0,2
...,...,...,...,...,...,...,...,...,...,...
47859,47860,2011-04-02,2011,66,34,2,3,0,0,2
47860,47861,2011-04-05,2011,66,54,3,6,0,0,2
47861,47862,2011-04-07,2011,66,48,3,0,0,0,2
47862,47863,2011-04-08,2011,66,45,1,6,1,0,2
47863,47864,2011-04-10,2011,66,44,2,5,1,0,2

In [44]:
def game_identifier(game):
    date_identifier = str(game['game_date'].date())
    
    team_identifier = "-".join(sorted([str(game['team_id']), str(game['opponent_id'])]))
    
    points_identifier = str(game['team_points'] + game['opponent_points'])
    
    return "-".join([date_identifier, team_identifier, points_identifier])

df['game_identifier'] = df.apply(game_identifier, axis=1)

df.head()

,id,game_date,game_season,team_id,opponent_id,team_points,opponent_points,is_team_home,is_overtime,league_id,game_identifier
0,1,2009-10-30,2010,1,6,86,99,0,0,1,2009-10-30-1-6-185
1,2,2009-10-31,2010,1,13,96,85,1,0,1,2009-10-31-1-13-181
2,3,2009-11-03,2010,1,11,81,83,0,0,1,2009-11-03-1-11-164
3,4,2009-11-06,2010,1,29,87,72,0,0,1,2009-11-06-1-29-159
4,5,2009-11-07,2010,1,12,102,87,1,0,1,2009-11-07-1-12-189

In [45]:
df[df['game_identifier'] == '2009-11-03-1-11-164']

,id,game_date,game_season,team_id,opponent_id,team_points,opponent_points,is_team_home,is_overtime,league_id,game_identifier
2,3,2009-11-03,2010,1,11,81,83,0,0,1,2009-11-03-1-11-164
7417,7418,2009-11-03,2010,11,1,83,81,1,0,1,2009-11-03-1-11-164

In [46]:
len(df)

47864

In [48]:
df.describe()

,id,game_season,team_id,opponent_id,team_points,opponent_points,is_team_home,is_overtime,league_id
count,47864.000000,47864.000000,47864.000000,47864.000000,47864.000000,47864.000000,47864.000000,47864.000000,47864.000000
mean,23932.500000,2014.570784,32.435463,32.435463,52.909682,52.909682,0.500000,0.147334,1.496114
std,13817.290979,2.901795,18.750063,18.750063,50.533429,50.533429,0.500005,0.354442,0.499990
min,1.000000,2010.000000,1.000000,1.000000,0.000000,0.000000,0.000000,0.000000,1.000000
25%,11966.750000,2012.000000,16.000000,16.000000,3.000000,3.000000,0.000000,0.000000,1.000000
50%,23932.500000,2015.000000,33.000000,33.000000,73.000000,73.000000,0.500000,0.000000,1.000000
75%,35898.250000,2017.000000,48.000000,48.000000,102.000000,102.000000,1.000000,0.000000,2.000000
max,47864.000000,2019.000000,66.000000,66.000000,168.000000,168.000000,1.000000,1.000000,2.000000

In [51]:
df['game_identifier'].nunique()

23932

In [52]:
len(df) / 2

23932.0